; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	spectrograph1 - mode
	spectrograph2 - mode
	thermograph0 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star6 - direction
	Star9 - direction
	GroundStation10 - direction
	Star11 - direction
	Star5 - direction
	GroundStation7 - direction
	Star2 - direction
	Star8 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 Star11)
	(supports instrument1 thermograph0)
	(supports instrument1 spectrograph1)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star8)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
)
(:goal (and
	(have_image Phenomenon12 spectrograph1)
	(have_image Phenomenon13 spectrograph2)
	(have_image Phenomenon14 thermograph0)
	(have_image Planet15 spectrograph1)
	(have_image Phenomenon16 thermograph0)
	(have_image Planet17 spectrograph1)
))

)

; plan
1. (turn_to satellite0 star8 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star8)
   goals met: 0 of 6
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 6
3. (calibrate satellite0 instrument1 star8)
   added: (calibrated instrument1)
   goals met: 0 of 6
4. (turn_to satellite0 phenomenon14 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 phenomenon14)
   goals met: 0 of 6
5. (take_image satellite0 phenomenon14 instrument1 thermograph0)
   added: (have_image phenomenon14 thermograph0)
   goals met: 1 of 6
6. (turn_to satellite0 phenomenon13 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon13)
   goals met: 1 of 6
7. (take_image satellite0 phenomenon13 instrument1 spectrograph2)
   added: (have_image phenomenon13 spectrograph2)
   goals met: 2 of 6
8. (turn_to satellite0 phenomenon12 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon12)
   goals met: 2 of 6
9. (take_image satellite0 phenomenon12 instrument1 spectrograph1)
   added: (have_image phenomenon12 spectrograph1)
   goals met: 3 of 6
10. (turn_to satellite0 phenomenon16 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon16)
   goals met: 3 of 6
11. (take_image satellite0 phenomenon16 instrument1 thermograph0)
   added: (have_image phenomenon16 thermograph0)
   goals met: 4 of 6
12. (turn_to satellite0 planet15 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 planet15)
   goals met: 4 of 6
13. (take_image satellite0 planet15 instrument1 spectrograph1)
   added: (have_image planet15 spectrograph1)
   goals met: 5 of 6
14. (turn_to satellite0 planet17 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet17)
   goals met: 5 of 6
15. (take_image satellite0 planet17 instrument1 spectrograph1)
   added: (have_image planet17 spectrograph1)
   goals met: 6 of 6
